[
  {
    "title": "Rasmussen wins the battle of Nashville",
    "slug": "rasmussen-wins-the-battle-of-nashville",
    "content": "HMD Motorsports’ Christan Rasmussen won a stop-start Indy Nxt race in Nashville to extend his points lead. As the championship leader, Rasmussen started from pole as qualifying was cancelled due to the weather. He wasted no time off the line and quickly pulled away from title rival Nolan Siegel, who soon dropped back. Rasmussen spent the first third of the race extending his lead and was more than five seconds ahead of Hunter McElrea in second when the first caution period occurred. Christian Bogle had put his nose into the wall at turn 11, prompting the pace car to come out. Racing resumed with 15 laps remaining, and McElrea was able to stay relatively close to Rasmussen. He was less than a second behind when an off for Ernie Francis Jr led to another caution period. Francis had been storming his way up through the order and was challenging Siegel for fifth just before his off. Again, Rasmussen got a clean getaway and was far enough ahead of McElrea to stop him from immediately challenging for position. Put the pace car came out again so McElrea was back on Rasmussen’s tail. This time Danial Frost had gone in the wall. Frost had been trying a move on James Roe Jr, after Roe got out of shape by going over a bump in the road. As he went to make a move, it opened the door for Rasmus Lindh who got alongside him, and Frost had nowhere to go. The final restart came with four laps remaining, and Rasmussen left it as late as possible before returning to racing speeds. That enabled him to get the jump on McElrea and he finished 1.1594s ahead of the Andretti Autosport driver. Jacob Abel took third after a race long-battle with Louis Foster. He was able to get ahead of Abel in the first part of the race, but Abel was back on the attack between the late caution periods. He got through with a move into turn 11 before the pace car’s final appearance. Foster immediately challenged Abel on the restart, but made slight contact as Abel moved to defend. He was sent up the escape road while Abel was penalised for blocking. He had to drop back behind Nolan Siegel, but soon came back past the rookie to reclaim third. Roe also passed Siegel late on to finish fourth. Siegel finished ahead of Foster, who recovered to sixth, ahead of Lindh, Jamie Chadwick and Reece Gold. Josh Pierson completed the top 10 while Yuven Sundaramoorthy took 11th in his Indy Nxt debut. ",
    "imgUrl": "https://cdn.discordapp.com/attachments/453949905636163618/1137756790461837442/image.png",
    "categoryId": 6,
    "authorId": "6526c20ea765ed44aa14ae1f"
  },
  {
    "title": "When Joest Outwits Factory Porche",
    "slug": "when-joest-outwits-factory-porche",
    "content": "Porsche brings 3 Rothmans factory team to the 1985 Le Mans 24 hours, but got defeated by Joest Racing Porsche. But in the end what matters is Porsche wins another Le Mans.",
    "imgUrl": "https://cdn.discordapp.com/attachments/453949905636163618/1040517214857605120/unknown.png",
    "categoryId": 5,
    "authorId": "6526c19ea765ed44aa14ae1d"
  }
]